#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
module.shared.data.terraform_remote_state.infrastructure_state: Reading...
module.shared.data.terraform_remote_state.infrastructure_state: Read complete after 0s

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.buckets.aws_s3_bucket_object.add_investment_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_investment_function_object" {
      ~ etag                   = "49978908e7c4364e580dd37af83d5181" -> "6f1749b3a8330c75bcf4e6dca089e9c6"
        id                     = "lambdas/demo/add_investment_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_scenario_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_scenario_function_object" {
      ~ etag                   = "054a88b0d263dd02626a8676a8039abd" -> "f671e6d0d4f80afae8bf7fcedb658ec4"
        id                     = "lambdas/demo/add_scenario_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_tag_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_tag_function_object" {
      ~ etag                   = "6bfb6bf716cf80c3dd61f104231049ee" -> "1170564136dc787c99aeaa79eb5f65f9"
        id                     = "lambdas/demo/add_tag_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_user_to_customer_group_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_user_to_customer_group_function_object" {
      ~ etag                   = "d625b5c257d75e28e9ab69d87fcc0f07" -> "694a85594b0f69780b9ea2d8fe85634b"
        id                     = "lambdas/demo/add_user_to_customer_group_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.assign_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "assign_company_permissions_function_object" {
      ~ etag                   = "28158ecad87bcdf2071c69aa2c8e9f13" -> "52b898ab67d861970392cc3ff253973c"
        id                     = "lambdas/demo/assign_company_permissions_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.authorize_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "authorize_function_object" {
      ~ etag                   = "b173331fc19bd14e36481bd110ec1222" -> "ef9005d420213cae0a41f35ea80c1483"
        id                     = "lambdas/demo/authorize_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_company_publicly_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_company_publicly_function_object" {
      ~ etag                   = "1a0ecdf7b71337268ee6bd352d0965f0" -> "92a51903a859cdd49a72b8ca8e64ac6c"
        id                     = "lambdas/demo/change_company_publicly_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_user_role_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_user_role_function_object" {
      ~ etag                   = "064daf03a7d617eeb98078d5f3a219df" -> "575e60a23d49159c633b5e55f3c4f58e"
        id                     = "lambdas/demo/change_user_role_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.connect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "connect_function_object" {
      ~ etag                   = "082886d91dd2164163d0206b5b9cc20b" -> "e17310bf00ab7e7fcbf9827558504dbc"
        id                     = "lambdas/demo/connect.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_company_function_object" {
      ~ etag                   = "aa9a3c3245207c14cb5be666ce9950d3" -> "4d61fa4b49529167cb12306e5cce7ce6"
        id                     = "lambdas/demo/delete_company_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_scenarios_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_scenarios_function_object" {
      ~ etag                   = "e11423f755b5190a8c875539ff3f9208" -> "994efdd70364ab24956f5e625f0c819c"
        id                     = "lambdas/demo/delete_scenarios_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_tags_function_object" {
      ~ etag                   = "de6d287628c8381d43ceba60d2b1ea02" -> "04806a666fb35da31461f19066321d5e"
        id                     = "lambdas/demo/delete_tags_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.disconnect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "disconnect_function_object" {
      ~ etag                   = "67110c33d998a8d32578d4e44e8273cc" -> "92ff49ba3e95e23f0578749356cac571"
        id                     = "lambdas/demo/disconnect.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.download_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "download_comparison_vs_peers_function_object" {
      ~ etag                   = "740b600363ed80c46301fea92149fde0" -> "fbdbb4256ac02a7ea89217191591d09a"
        id                     = "lambdas/demo/download_comparison_vs_peers_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "edit_modify_data_function_object" {
      ~ etag                   = "1e1aff9e42d64bf37484a2835a4a28cf" -> "e067e7bc0df80da5acbb309781366057"
        id                     = "lambdas/demo/edit_modify_data_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_companies_function_object" {
      ~ etag                   = "77762a290f44ecf7a9bff749a0197356" -> "b7332e5f46f8b6f473ffb18d472d9bb1"
        id                     = "lambdas/demo/get_all_companies_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_public_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_public_companies_function_object" {
      ~ etag                   = "e0d2350b480c9f2e49d013e3ee4f3483" -> "8781a4ebd1dabc20c2e8db003b5153b4"
        id                     = "lambdas/demo/get_all_public_companies_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_ranges_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_ranges_function_object" {
      ~ etag                   = "5e289b854b8ae4c9bc88e07d8efd895c" -> "997aee5d140c72e6fc94bcabe4c82258"
        id                     = "lambdas/demo/get_all_ranges_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_tags_function_object" {
      ~ etag                   = "acd22d8b10dc2629cff3ac0b145f85a6" -> "3e3149bc22797f89813cc76810fa5fde"
        id                     = "lambdas/demo/get_all_tags_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_by_metric_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_by_metric_report_function_object" {
      ~ etag                   = "5044f2ddf99a1f58f60b7b2e5044b07f" -> "bd385b8b7b187dbda15cc0adbbb8744a"
        id                     = "lambdas/demo/get_by_metric_report_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_details_function_object" {
      ~ etag                   = "f399f3ec7c9f86082f221cfc51d78f02" -> "46c5b02ecd9d2a6fed4526f5047cba2a"
        id                     = "lambdas/demo/get_company_details_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_investments_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_investments_function_object" {
      ~ etag                   = "53fb5af303c7555d37af81baa1e77719" -> "1ea6f95a5c9809810864bd992dd24c6e"
        id                     = "lambdas/demo/get_company_investments_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_permissions_function_object" {
      ~ etag                   = "dd0301ac1f7be65e2a22ccaabe2769fc" -> "ce72f72cb521521d4520f014d683d5f4"
        id                     = "lambdas/demo/get_company_permissions_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_report_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_report_vs_peers_function_object" {
      ~ etag                   = "effac2b751a22bd2d98af05073197cc1" -> "d86e7ec4c8351208b0c738345c324058"
        id                     = "lambdas/demo/get_company_report_vs_peers_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_comparison_vs_peers_function_object" {
      ~ etag                   = "8ea237401d3e201996cd2934acf6689b" -> "95daf0d93f3ab1637e8faf64a2e67a1b"
        id                     = "lambdas/demo/get_comparison_vs_peers_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_dynamic_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_dynamic_report_function_object" {
      ~ etag                   = "3b76466691b2bebd8c4347d74f39a74e" -> "12dd95f9b3fb253bee9700755c36b5bd"
        id                     = "lambdas/demo/get_dynamic_report_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_edit_modify_data_function_object" {
      ~ etag                   = "f2c91ab053701a15b21056cb5def442c" -> "1bcce95ccbea2ba2a3caf8b9e7315644"
        id                     = "lambdas/demo/get_edit_modify_data_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_full_year_total_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_full_year_total_function_object" {
      ~ etag                   = "b2ef4a8b899c4df6066fa4e10c4fe49f" -> "6bdc5f21c96b47d850e5a720e7f7a09f"
        id                     = "lambdas/demo/get_full_year_total_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_investment_date_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_investment_date_report_function_object" {
      ~ etag                   = "7658352201ffbf6afbfc6f44f0a3e83d" -> "9c2f53d5f1d00d632f7bdfdcaecb3d98"
        id                     = "lambdas/demo/get_investment_date_report_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_metric_types_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_metric_types_function_object" {
      ~ etag                   = "4f1e11549163dfc49ae8d403032f3458" -> "2a6af4836f1c8b3af270ed7b66648e72"
        id                     = "lambdas/demo/get_metric_types_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_quarters_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_quarters_report_function_object" {
      ~ etag                   = "e2fb7229cc789166e5832dfca4473915" -> "eb0b9c21330a1d9f310dec4cb6b7f264"
        id                     = "lambdas/demo/get_quarters_report_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_ranges_by_metric_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_ranges_by_metric_function_object" {
      ~ etag                   = "ea57270fefbc31f295de9c5f2f19478d" -> "2c1ddb6132dccedf2b9f3d29ffde6d07"
        id                     = "lambdas/demo/get_ranges_by_metric_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_roles_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_roles_function_object" {
      ~ etag                   = "e6a546f3a64cf1b8a5663eb5423ac6ce" -> "67c9438bcebbfad3974e0626e074c8e6"
        id                     = "lambdas/demo/get_roles_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_tags_by_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_tags_by_company_function_object" {
      ~ etag                   = "626de23d4632ab80b007e6dcb9bc10ab" -> "52273956c56eee89c11612eb2a3dcc62"
        id                     = "lambdas/demo/get_tags_by_company_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_universe_overview_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_universe_overview_function_object" {
      ~ etag                   = "7f77ca41d8b24a5932853e5aa1d45c3d" -> "a3927d18e16f4eeb2990cd42a5ff67ed"
        id                     = "lambdas/demo/get_universe_overview_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_user_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_user_details_function_object" {
      ~ etag                   = "972a6a938dd7cbe4bf5e1b3f541c6bb9" -> "61e79faa33f184ed812b50bc79fed25b"
        id                     = "lambdas/demo/get_user_details_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_users_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_users_function_object" {
      ~ etag                   = "cad73ba83e9a69389886f66c585d5aea" -> "ce9159cdd42ff44989a28a33157fc19d"
        id                     = "lambdas/demo/get_users_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.glue_trigger_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "glue_trigger_function_object" {
      ~ etag                   = "fb3b34e72d12a643733f33ae12f3444c" -> "937b8c107660e5d16a7a8499ed3d9b77"
        id                     = "lambdas/demo/glue_trigger_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.layer_libraries_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "layer_libraries_object" {
      ~ etag                   = "63adc3dfcbbb8d80e3c5ca9cced34179" -> "b8be30166dd99ed3c5095c807076ee2d"
        id                     = "layer/demo/layer_libraries.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.message_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "message_function_object" {
      ~ etag                   = "cc83de0fa4bebf831cf4a4ae467282d4" -> "90df34c281bb20eb9112690023dab1be"
        id                     = "lambdas/demo/message.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.modify_ranges_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "modify_ranges_function_object" {
      ~ etag                   = "2d630ef4063fa3d73a18502e29850cd5" -> "fb7b105089eb92bcf8d599c17c6f6562"
        id                     = "lambdas/demo/modify_ranges_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.register_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "register_function_object" {
      ~ etag                   = "cab697472f30fc827ca1996e3a415880" -> "0b683acaa7b538ed86e7ebca89e133a2"
        id                     = "lambdas/demo/register.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_data_function_object" {
      ~ etag                   = "ee892eca0a622d9c865a63bd204ab307" -> "466b17a01a341f8267c47bb81266c33e"
        id                     = "lambdas/demo/update_data.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_tags_function_object" {
      ~ etag                   = "84902a6e09f5f1d9cf9d1dc517e8a157" -> "c0d5e2c580ba676fb2b3747d8ee46bb4"
        id                     = "lambdas/demo/update_tags_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.upload_file_s3_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "upload_file_s3_function_object" {
      ~ etag                   = "3616fb2b9669bcf3fbf461f08e48ec1f" -> "4d3972c09c6e0ce2755626a679f0e336"
        id                     = "lambdas/demo/upload_file_s3_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.validate_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "validate_data_function_object" {
      ~ etag                   = "528f10818b49539a944476d01e4c54d0" -> "d0db11b91b9ef497a3c127a44305dc01"
        id                     = "lambdas/demo/validate_data_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.verify_users_with_same_email_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "verify_users_with_same_email_function_object" {
      ~ etag                   = "e2b3511b39a74c5c70ae19a1fda0ac34" -> "8c5878658df5a23bc949889c535c8853"
        id                     = "lambdas/demo/verify_users_with_same_email_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.functions.aws_lambda_function.add_investment_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_investment_lambda_function" {
        id                             = "demo_add_investment_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:28.000+0000" -> (known after apply)
      ~ source_code_hash               = "I7vo+jTRb6BCbKMUiyTK+DuFs9zxgWfGrbad79hzuRE=" -> "FM3xfQXNhZzn877XbykWk46b09NTQirhaw6vw43jpAg="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_scenario_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_scenario_lambda_function" {
        id                             = "demo_add_scenario_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "AbjR8/5hiWNs6PVWzYVJhbNZYf2rshrMOHm/RY+jiko=" -> "43Z732GUilffnVgKsjLxLL7EgwQvfDt0ZtIcTduk+U4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_tag_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_tag_lambda_function" {
        id                             = "demo_add_tag_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:40.000+0000" -> (known after apply)
      ~ source_code_hash               = "ogbTPZS4lEQ+7wTuvf+Uvhl8Ol78+ntCbYWRXHWA7h8=" -> "Lcqeyw5PNy2zUvSJkttfZSm4x5F8zTIi2Ly7vItiRfk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_user_to_customer_group_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_user_to_customer_group_lambda_function" {
        id                             = "demo_add_user_to_customer_group_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:17.000+0000" -> (known after apply)
      ~ source_code_hash               = "yFf89J3AhTHCmlvZHnUj2Q8NSBr5aWUlLyoR6PkazuU=" -> "U+ZHEwBrFQp7gq93/XRp0089n1ZL7zyodPnyDMzeLvc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.assign_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "assign_company_permissions_lambda_function" {
        id                             = "demo_assign_company_permissions_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:41.000+0000" -> (known after apply)
      ~ source_code_hash               = "3hrVyF67Vd8LktP9WXlhjATkdEPKfgRRoxBnj9MxRKk=" -> "D41QfG+rhGlN9ZCyNPSdsueJxp+a2mhdrD51JBD8wcs="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.authorize_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "authorize_lambda_function" {
        id                             = "demo_authorize_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:55.000+0000" -> (known after apply)
      ~ source_code_hash               = "RDOQjHXM0AaOTBGPKwBlxgtG7SetR3P8LAmWx2D4sLA=" -> "OVFggGPJ9PTOkmUljy2JqA4Yk9c1Wel5/18MgIwonR4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_company_publicly_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_company_publicly_lambda_function" {
        id                             = "demo_change_company_publicly_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:07.000+0000" -> (known after apply)
      ~ source_code_hash               = "F+Qb0efzVtk32umzT+X5IfcoayqGDhxxYCFL9eqYC0s=" -> "VthWJbK9tCVvYa82+eOPMsLek1sV4l0pRzsyj9koMyo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_user_role_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_user_role_lambda_function" {
        id                             = "demo_change_user_role_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:36.000+0000" -> (known after apply)
      ~ source_code_hash               = "KNMQfz0DRyjNfvO2NKsXVDfYguqnawjNK8OQB+ZH9kQ=" -> "wyHXyZVqhFSQ8+IuwRgas2V6C0iwLkLLleqD0OnRQh8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.connect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "connect_lambda_function" {
        id                             = "demo_connect_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:14.000+0000" -> (known after apply)
      ~ source_code_hash               = "uebFC8Y4/K7eFFUd/zW48S2U6hYnKTVBQY6e4YtVr1M=" -> "oITBDTD/9Qb7AqVCsrXNvGT1P/lPbmWw/ZR/+z90uNw="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.functions.aws_lambda_function.delete_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_company_lambda_function" {
        id                             = "demo_delete_company_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:40.000+0000" -> (known after apply)
      ~ source_code_hash               = "oijQS2GWzk/Jqz9WUnfAYLAqC8H77t3TiWrvxDKXysI=" -> "l7tohPTXARC4D1f150RdxAqnipS73mfc/9dqrtC+/PI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_scenarios_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_scenarios_lambda_function" {
        id                             = "demo_delete_scenarios_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "zWINWU1K8P9ZcfdZ9L4kAWAGs+mkvSAPXTKx/9vwuoY=" -> "mWxmJDk+e7uocbK3jgY1gOEDmiJBrrLgzjaWoOgGYPM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_tags_lambda_function" {
        id                             = "demo_delete_tags_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "r9embf8SeSPTLEGxbxfv9FZ2Wnxbf4T9xy3GxMpPjFs=" -> "1NbP8KUP8JBhQleQ9vqkZ0c7D+nuH7tD08QSfc5wrTo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.disconnect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "disconnect_lambda_function" {
        id                             = "demo_disconnect_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:52.000+0000" -> (known after apply)
      ~ source_code_hash               = "0h7UqGBMOAn40vZRwrVWYvFdcilGWPaBh4+ZmX08Pls=" -> "C1Cm6DcCnpUT+yhkXZVFk72YhB8wkG8OWLapE/uL2Bc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.download_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "download_comparison_vs_peers_lambda_function" {
        id                             = "demo_download_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "usxalsFxE2EJa6ZGxLXdbifnFuYDd+fBTNzxRU5EVpE=" -> "NXeQqLsXL155u66rlYxBC+LWPTjMeAlE6Q77jfhmVIw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "edit_modify_data_lambda_function" {
        id                             = "demo_edit_modify_data_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "xxqKDCGNE4FS6e6YfAO73dlwKMeqaIbmrXNLc6utRYw=" -> "HfxKGozhw7UqCMl+/iV87ZC1M9MUCz6KoNzMdRlHpfA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_companies_lambda_function" {
        id                             = "demo_get_all_companies_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:16.000+0000" -> (known after apply)
      ~ source_code_hash               = "8S2/G9/nCjy5xbLwvOe53gX74hfySHOuSnEJRQWfelI=" -> "+AqLDFLtgYCcJMwcUKThpaIKYRyMsLqo88NAY0Bjoyg="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_public_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_public_companies_lambda_function" {
        id                             = "demo_get_all_public_companies_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:28.000+0000" -> (known after apply)
      ~ source_code_hash               = "IgLfBUXRiw6Z9snqc3rVgIAqVZbbLaiye7bvT3TVsf8=" -> "1zYSbuUeZ76s4QlSd1RmaPX76SZgyfbJDrUnuenKFFg="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_ranges_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_ranges_lambda_function" {
        id                             = "demo_get_all_ranges_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:39.000+0000" -> (known after apply)
      ~ source_code_hash               = "vdmF9SNMwepfX3WbpZHqfJIlKNncpi9/8aDVYZci8Ng=" -> "lpdP+fjboXk8KE2FRFvL7fnucSgNBSdABQm8im/ddFQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_tags_lambda_function" {
        id                             = "demo_get_all_tags_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:48.000+0000" -> (known after apply)
      ~ source_code_hash               = "Q7ovP7QW+FZNeUOXENZEc2hlah2LMXrREwkpniwy17E=" -> "Ch48EJ2AdscU8QU0vq2YKg6NeWBMATOE6FkeamnQGeM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_by_metric_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_by_metric_report_lambda_function" {
        id                             = "demo_get_by_metric_report_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "/fj2hupGCYPggRAHam7fOlB8NhAgBHs3nYHb/rFThBg=" -> "3U+bTdUET+N2/C5rrVUJ6uuo2XNT+s6E1X2dWkBHZCo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_details_lambda_function" {
        id                             = "demo_get_company_details_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:30.000+0000" -> (known after apply)
      ~ source_code_hash               = "YJEmcJtirN+DFDKmfCrdLluS2G7wADCNvC3sGtMF78Q=" -> "//BvxhOpIGvvk2id1tKLPNhcwtFzEdXJnY/r6EbyT08="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_investments_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_investments_lambda_function" {
        id                             = "demo_get_company_investments_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "FR+4PNL1cdoahVEDbbKNYggPBPJVF+FuZ/vWiX1wXUs=" -> "B58cQPEc5AmpHiL3SkzOjy12QHx0GmTUfEuPrT3YZ7I="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_permissions_lambda_function" {
        id                             = "demo_get_company_permissions_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:41.000+0000" -> (known after apply)
      ~ source_code_hash               = "AzcGwYTqYaYK7J1SH6IGQ3rD7FnxRsAAgcEuyRkvgI0=" -> "hHfmOY5sNV7frxS5Au/Zxhv9jUjSQQYiCpyofManV90="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_report_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_report_vs_peers_lambda_function" {
        id                             = "demo_get_company_report_vs_peers_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:55.000+0000" -> (known after apply)
      ~ source_code_hash               = "yODY9zTLRxFH9/SZG/eed8IshboWD/pK0r/Nsj4rXCw=" -> "EJO1DVvB0dtMwWefCr92R2MsOZPB0hBWPzbi4WfetBM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_comparison_vs_peers_lambda_function" {
        id                             = "demo_get_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:28.000+0000" -> (known after apply)
      ~ source_code_hash               = "UV8NuV5j9GE/yz2aMTwIwyWinCIBLCbRDjExUsNkx70=" -> "SoUdb9IDM2QJhG6UUu6hizoXl730AFeUfuhtBzx+8i0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_dynamic_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_dynamic_report_lambda_function" {
        id                             = "demo_get_dynamic_report_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:54.000+0000" -> (known after apply)
      ~ source_code_hash               = "y2N05WJwh2zaGyxb/8JJHubRAQvCmWpny5NrKT84T54=" -> "37yURKFHVw18kaDqhnHbjRi8eDOJVUrnbnNxorMMmAU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_edit_modify_data_lambda_function" {
        id                             = "demo_get_edit_modify_data_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:53.000+0000" -> (known after apply)
      ~ source_code_hash               = "1Hde0chkVPzhGUTdW7OIfzM77rBB4ZAjab5i2xJZuVI=" -> "6/AngTBSb99pmLlcWy3JZoqjWjnUAM209lACi05qmXA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_full_year_total_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_full_year_total_lambda_function" {
        id                             = "demo_get_full_year_total_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:45.000+0000" -> (known after apply)
      ~ source_code_hash               = "znH14WJuN5LSCJ+kACI+6nr0ebcIeVF9IptEn4Fxs5c=" -> "ZedJPBajXuC7vcFsl4MtmGRPLD5BgiMzw2MVMj+uCHs="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_investment_date_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_investment_date_report_lambda_function" {
        id                             = "demo_get_investment_date_report_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:16.000+0000" -> (known after apply)
      ~ source_code_hash               = "E3T7H9+zyHVlc7Qo9FVzRJfLB4t0wkMM9yKeiJlgoJE=" -> "tailBxDZFI8oWo8VvoeR6PwA4jX+Ph9mIpo/MprZZfQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_metric_types_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_metric_types_lambda_function" {
        id                             = "demo_get_metric_types_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:28.000+0000" -> (known after apply)
      ~ source_code_hash               = "G5NvU0N9zNfuHpRjsZcOlJME+ZKjQonL9aanGqlX8tE=" -> "LbkbHThIl0sO2mvSk2Cv4lEU1mZMuM+ctDaquJL9BYw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_quarters_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_quarters_report_lambda_function" {
        id                             = "demo_get_quarters_report_lambda_function"
      ~ last_modified                  = "2023-02-14T20:32:14.000+0000" -> (known after apply)
      ~ source_code_hash               = "wAScdfLK6ANQLC/8au8ahDhTeYp078JPOUav0ZAnMfM=" -> "pNhhkDAB7HkMcZH5V+6foNjDpfWjxonsUnv7S3HRpxk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_ranges_by_metric_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_ranges_by_metric_lambda_function" {
        id                             = "demo_get_ranges_by_metric_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:52.000+0000" -> (known after apply)
      ~ source_code_hash               = "Prtn8+O/GqRk7XHgXMR/YXqMv+3brI9ZZ1VU1dAweaI=" -> "LQMGL8nYWUavZMZIt7mB1kjf+Y7Omqf9GoKdf8GirLY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_roles_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_roles_lambda_function" {
        id                             = "demo_get_roles_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:42.000+0000" -> (known after apply)
      ~ source_code_hash               = "z3hTUThwvxGgCV674FEs+qKK+lbDiEjqF6rJgr1scXQ=" -> "Nh6nAsIq53H70bDkpi+Ru+rwRDwFF27w40DHHJw+zPM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_tags_by_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_tags_by_company_lambda_function" {
        id                             = "demo_get_tags_by_company_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:17.000+0000" -> (known after apply)
      ~ source_code_hash               = "6u5B3O1/muZLul8YsXeDFRcG+9ipyWXf6x58d9GGD/0=" -> "zYSsjQuL8QtPhke1ZbppZXLIhKDAODNmH5AUdKQ5JUo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_universe_overview_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_universe_overview_lambda_function" {
        id                             = "demo_get_universe_overview_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "SENwF1tJx2hGshJ8+RBm/Y9qTIifxQOh/xSVrWH3dw4=" -> "g+dyj+6zGLl4mEKyftd+zOa0ZuVK6+Qk9wugAQ/e2Y8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_user_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_user_details_lambda_function" {
        id                             = "demo_get_user_details_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:44.000+0000" -> (known after apply)
      ~ source_code_hash               = "2hQc7B8chDahO1FO82rnJGdKGjJ1UIaZYlL7cSLRgLM=" -> "r7yNLW/eymttjZuQep2fXV6TeX3jA9mhceRiO7NlGDU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_users_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_users_lambda_function" {
        id                             = "demo_get_users_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:28.000+0000" -> (known after apply)
      ~ source_code_hash               = "ZWSJlb3s50Dr+bwlc40cWaZ59aQzDyTIHBJlNbSwe/4=" -> "z1GfQe+y8kY8UKrMEVx+gblvPz5EQi9aDCU50//p/y0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.glue_trigger_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "glue_trigger_lambda_function" {
        id                             = "demo_glue_trigger_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:22.000+0000" -> (known after apply)
      ~ source_code_hash               = "DcCkhnt4oLE4F2M7KeFvd/jo6+78TTQZXiyBBdooSnY=" -> "dHAY358rng2MgsCJWOxhwcx/DGDLp30bb5PVUl/M278="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.message_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "message_lambda_function" {
        id                             = "demo_message_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:16.000+0000" -> (known after apply)
      ~ source_code_hash               = "NW1heEXbJ1OI9sWpPbvW7fFz8U//l7MLJV3jE9rHmss=" -> "opxump3+wA9W6RxlkDYCCDvygcRc/vjvqk4nnOB4AnA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.modify_ranges_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "modify_ranges_lambda_function" {
        id                             = "demo_modify_ranges_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:27.000+0000" -> (known after apply)
      ~ source_code_hash               = "k6YdB6//Bazrpepto6TekOmQlTjUhKA3V80xIdeOcgw=" -> "KGCDr2IOvkM9Ec+RK5LHtRp1lWSU57bEjZphma1Ggzk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.register_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "register_lambda_function" {
        id                             = "demo_register_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:29.000+0000" -> (known after apply)
      ~ source_code_hash               = "CJG4oaEP4lTzztQ2ee0P0AahjjSs4MGtN3HXwRiz+Mk=" -> "6H/myE/gwAfO9tlZ6q1BuOs3zM+J0KK9mSOnxz61XSM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_data_lambda_function" {
        id                             = "demo_update_data_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:17.000+0000" -> (known after apply)
      ~ source_code_hash               = "BodYvOnXHO8WponQvzii7V/awIKBf9a5eMkCl738HAw=" -> "/vJesLf5fB2amuTCDU3pzAmVVBCOGvJvyh9DGBnm0lA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_tags_lambda_function" {
        id                             = "demo_update_tags_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:33.000+0000" -> (known after apply)
      ~ source_code_hash               = "8fFHsQFtkVE3YZMVThsDIku5ISKpKe0WIDaofALWs0I=" -> "4I14Yb2+LLRtgD+oOSclJZ+jEVrf5v96aYkOijiGk+I="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.upload_file_s3_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "upload_file_s3_lambda_function" {
        id                             = "demo_upload_file_s3_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:47.000+0000" -> (known after apply)
      ~ source_code_hash               = "g9aNvE7Xap0zWywBDE2FhCFuAueKDN8z1/RFFO9D+ro=" -> "BPGVTDzhNFOaNnOBH7lQrw3VRJTD8qDc/KNu4Bfqsoc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.validate_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "validate_data_lambda_function" {
        id                             = "demo_validate_data_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:19.000+0000" -> (known after apply)
      ~ source_code_hash               = "aotxLo1S+WGUpeI8AyvjmUIkV1ldjc6+Kh/fqWjSY8U=" -> "+kUV5Jhkw9vWLkIwC6LQwqKL41XKFO9lDMTSc0YueoU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.verify_users_with_same_email_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "verify_users_with_same_email_lambda_function" {
        id                             = "demo_verify_users_with_same_email_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "dh4axu8yUAmyi+QOo5meAF2PXYYYlvQciCNNSWWX9OU=" -> "U3ZYmtqJwjiIfe3EZvJLP+UmebjLDloKv4DMn0yuCK4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.gateway_deployment.aws_api_gateway_deployment.gateway_deployment must be replaced
+/- resource "aws_api_gateway_deployment" "gateway_deployment" {
      ~ created_date      = "2023-02-13T05:03:45Z" -> (known after apply)
      ~ execution_arn     = "arn:aws:execute-api:us-west-2:435552912911:kb7gblbu69/demo" -> (known after apply)
      ~ id                = "nkvkm6" -> (known after apply)
      ~ invoke_url        = "https://kb7gblbu69.execute-api.us-west-2.amazonaws.com/demo" -> (known after apply)
      ~ stage_description = "Deployed at 2023-02-13T05:03:44Z" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_deployment.deploy will be updated in-place
  ~ resource "aws_apigatewayv2_deployment" "deploy" {
      ~ description   = "Deployed at 2023-02-13T05:03:42Z" -> (known after apply)
        id            = "ey3sgf"
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_stage.stage will be updated in-place
  ~ resource "aws_apigatewayv2_stage" "stage" {
        id              = "demo"
        name            = "demo"
        tags            = {}
        # (8 unchanged attributes hidden)

      - access_log_settings {
          - destination_arn = "arn:aws:logs:us-west-2:435552912911:log-group:testing_websocket_api" -> null
          - format          = jsonencode(
                {
                  - caller       = "$context.identity.caller"
                  - connectionId = "$context.connectionId"
                  - eventType    = "$context.eventType"
                  - ip           = "$context.identity.sourceIp"
                  - requestId    = "$context.requestId"
                  - requestTime  = "$context.requestTime"
                  - routeKey     = "$context.routeKey"
                  - status       = "$context.status"
                  - user         = "$context.identity.user"
                }
            ) -> null
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 95 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didnt use the -out option to save this plan, so Terraform cant
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @FreddyJR1995, Action: `pull_request`*